# Вы пользуетесь общественным транспортом? 
# Вероятно, вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

# *Пример:*

# 385916 -> yes
# 123456 -> no

nums = input('Введите номер билетика: ')
print('yes' if int(nums[0]) +  int(nums[1]) + int(nums[2]) == int(nums[3]) +  int(nums[4]) + int(nums[5]) else 'no')